src/tr069/samples/tr069_get_parameter_attributes_2param_req.xml

<soapenv:Envelope
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
    <soapenv:Header>
      <cwmp:ID soap:mustUnderstand="1">1234</cwmp:ID>
    </soapenv:Header>
    <soapenv:Body>
      <cwmp:GetParameterAttributes>
	<ParameterNames soap:arrayType="xsd:string[2]">
	  <string>InternetGatewayDevice.ManagementServer.ConnectionRequestUsername</string>
	  <string>InternetGatewayDevice.ManagementServer.ConnectionRequestPassword</string>
	</ParameterNames>
      </cwmp:GetParameterAttributes>
    </soapenv:Body>
</soapenv:Envelope>
